<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5bc9215b458a4e7e37b4946586ccc504df6fbbe453b455a6cbfe5ac8c55bf6b4","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #886 at https://github.com/cal-itp/data-infra/actions/runs/18918271112","plan_out_hash":"d2317eb0b4eb4ade0af4fe595f23a370ab4a38c6d58d59f38c7ee5cbe3fe24ea","plan_hash":"148b6448cffaaec963c0b9f1fd7fedb1488e083202717e0b4b377d67ede9af4e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "HFLpFA==" -> (known after apply)
!~      detect_md5hash      = "AxlvqGlF0XQytL7X6uBrow==" -> "different hash"
!~      generation          = 1761674676592506 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "AxlvqGlF0XQytL7X6uBrow==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/_mart_benefits.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "/bAzyg==" -> (known after apply)
!~      detect_md5hash      = "Prx7c4IxgDMgw+Po6fnmEA==" -> "different hash"
!~      generation          = 1754938421540880 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/_mart_benefits.yml"
!~      md5hash             = "Prx7c4IxgDMgw+Po6fnmEA==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/_mart_benefits.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "nH3www==" -> (known after apply)
!~      detect_md5hash      = "OBSSkvprb5n9Ku1SrsDS7A==" -> "different hash"
!~      generation          = 1755876748862218 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "OBSSkvprb5n9Ku1SrsDS7A==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "JvfK6A==" -> (known after apply)
!~      detect_md5hash      = "/ncG1pOau+Ob3onRgEJBiQ==" -> "different hash"
!~      generation          = 1761674678163486 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "/ncG1pOau+Ob3onRgEJBiQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #886](https://github.com/cal-itp/data-infra/actions/runs/18918271112)